zandbak/20170410skopei_test/test_soap.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:tns="Skopei/Reservation"><soap:Body><addVehicleReservation xmlns="Skopei/Reservation"><ID>COMMONBIKE</ID><Hash>24894A7B022229834BB7268C9549B0A6A1F80EFADE1933F6F535DAFAFD9E5563</Hash><MessageID>84922</MessageID><Reservation><q4:DateEnd xmlns:q4="http://schemas.datacontract.org/2004/07/">2017-04-13T09:25:19.748Z</q4:DateEnd><q4:DateStart xmlns:q4="http://schemas.datacontract.org/2004/07/">2017-04-12T09:25:19.748Z</q4:DateStart><q4:ExternalID xmlns:q4="http://schemas.datacontract.org/2004/07/">5437710000</q4:ExternalID></Reservation><Reservationitems><Vehicle[]><ReservationItemData><Code>9999</Code><ElockID>160020</ElockID><ExternalID>5437710000</ExternalID></ReservationItemData></Vehicle[]></Reservationitems></addVehicleReservation></soap:Body></soap:Envelope>
